---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.NLevelFafArea
source: html/467e6479-bdbb-8905-bf5e-f2c118c6168b.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.NLevelFafArea Property

The surface area of the intersection of the MassLevelData's level with the mass geometry.

## Syntax (C#)
```csharp
public double NLevelFafArea { get; }
```